Revit 2024 API
IViewSheetSet.ViewOrganizationId Property
ElementId to the BrowserOrganization for non-sheet views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
ElementId ViewOrganizationId { get; set; }
Visual Basic
Property ViewOrganizationId As ElementId
	Get
	Set
Visual C++
property ElementId^ ViewOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible.
See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace